Revit 2024 API
RebarHookType.IsOffsetLengthRequired Method
 Check whether hook offset length is required. remarks: If hook angle is no more than 90 degree, hook offset length is not meaningful. returns: True if hook offset length is required, otherwise false.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsOffsetLengthRequired()
Visual Basic
Public Function IsOffsetLengthRequired As Boolean
Visual C++
public:
bool IsOffsetLengthRequired()
See Also
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace